Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОбработчикЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ОбработчикЭтапов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Алгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОбработчикЭтапов/Forms/РедакторАлгоритмов/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокАлгоритмовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВставляемыйТекст = "Алгоритм(""" + Элементы.СписокАлгоритмов.ТекущиеДанные.ИмяАлгоритма + """, Неопределено)";
	
	ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
    
    Если ОкноБраузера <> Неопределено Тогда
        // Вызываем нашу новую JS-функцию и передаем туда текст
        ОкноБраузера.insert1CCodeAtCursor(ВставляемыйТекст);
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // В реальной задаче этот HTML лучше хранить в Макете (Тип: Текстовый документ)
    // и подключать локальные файлы JS/CSS, чтобы редактор работал без интернета.
    // Для нашего концепта загрузим библиотеку через CDN напрямую из сети.
	
    ТекстHTML = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("ТекстПоляHTML").ПолучитьТекст();
	
	Текст_CM_JS   = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("codemirror_min_js").ПолучитьТекст();
	Текст_CM_CSS  = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("codemirror_min_css").ПолучитьТекст();
	Текст_Simple_JS = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("simple_min_js").ПолучитьТекст();	

	ТекстHTML = СтрЗаменить(ТекстHTML, "%CodeMirrorCSS%", Текст_CM_CSS);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%CodeMirrorJS%",  Текст_CM_JS);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%SimpleJS%",      Текст_Simple_JS);    
    // Тестовый код, который мы передадим в редактор
    Алгоритм = Параметры.Алгоритм;
	Подсказка = Параметры.Подсказка;
	Параметры.Свойство("ПроверочныйКод", ПроверочныйКод);
    
КонецПроцедуры
&НаКлиенте
Процедура ОК(Команда)
	ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
	
	РезультатЗакрытия = Новый Структура("Алгоритм, ПроверочныйКод", 
		ОкноБраузера.get1CCode(), ПроверочныйКод);
	
	Закрыть(РезультатЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолеРедактораДокументСформирован(Элемент)
    
    // Как только документ загрузился, вызываем JS-функцию set1CCode
    // Обращение к функциям JS идет через свойство 'defaultView' документа DOM
    ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
    
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.set1CCode(Алгоритм);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПоле(Команда)
	ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаДереваМетаданных",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ФорматнаяСтрока(Команда)
	
	КФС = Новый КонструкторФорматнойСтроки;
	Результат = Ждать КФС.ОткрытьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
	
	Если ОкноБраузера <> Неопределено Тогда
		// Вызываем нашу новую JS-функцию и передаем туда текст
		ОкноБраузера.insert1CCodeAtCursor("""" + Результат + """");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеЗаданияПроверочногоКода(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверочныйКод = Результат;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПроверочныйКод(Команда)
	
	ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
	
	КодОбработки = ОкноБраузера.get1CCode();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗаданияПроверочногоКода", ЭтаФорма);
	ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаПроверкиАлгоритма", 
		Новый Структура("ПроверочныйКод, ИсходныйТекст", ПроверочныйКод, КодОбработки),
		ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылку(Команда)
	
	iga_УниверсальныеОбработчикиНаКлиенте.ВставитьСсылку(ЭтаФорма, Элементы.ПолеРедактора);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаСервере(КодОбработки)
    // Массив для хранения стека вызовов (нужен для защиты от бесконечного цикла)
    СтекВызовов = Новый Массив;
    
	
	Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
	Обработчик.ВходящиеПараметры = Новый Структура("Чат");
	
    Возврат Обработчик.ВыполнитьОбработчикСУчетомАлгоритмов(КодОбработки);
КонецФункции

&НаКлиенте
Процедура Проверить(Команда)
	
	Попытка
		
		ОкноБраузера = Элементы.ПолеРедактора.Документ.defaultView;
		
		КодОбработки = ОкноБраузера.get1CCode();
		
		КодОбработки = ПроверочныйКод + Символы.ПС + КодОбработки;
		
        РезультатВыполнения = ПроверитьНаСервере(КодОбработки);
		ВвестиСтрокуАсинх(Строка(РезультатВыполнения), "Алгоритм выполнен успешно!", 1000, Истина);
    Исключение
        Сообщить("Ошибка при выполнении: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНаСпецМетку(Команда)
	
	iga_УниверсальныеОбработчикиНаКлиенте.ВставитьПроверкуНаСпецМетку(ЭтаФорма, Элементы.ПолеРедактора);
		
КонецПроцедуры
